GD32-MCU-IOT/hal_gigadevice_zephyr/include/dt-bindings/pinctrl/gd32f503v(g-e-c)xx-pinctrl.h
/* CK_OUT */
#define CK_OUT_PA8 \
	GD32_PINMUX_AF('A', 8, AF3)
#define CK_OUT_PB3 \
	GD32_PINMUX_AF('B', 3, AF4)

/* CMP0_OUT */
#define CMP0_OUT_PA0 \
	GD32_PINMUX_AF('A', 0, AF5)
#define CMP0_OUT_PA1 \
	GD32_PINMUX_AF('A', 1, AF5)
#define CMP0_OUT_PA6 \
	GD32_PINMUX_AF('A', 6, AF5)
#define CMP0_OUT_PB0 \
	GD32_PINMUX_AF('B', 0, AF5)
#define CMP0_OUT_PB1 \
	GD32_PINMUX_AF('B', 1, AF5)

/* CTC_SYNC */
#define CTC_SYNC_PA8 \
	GD32_PINMUX_AF('A', 8, AF5)
#define CTC_SYNC_PD15 \
	GD32_PINMUX_AF('D', 15, AF2)

/* DAC0_OUT0 */
#define DAC0_OUT0_PA4 \
	GD32_PINMUX_AF('A', 4, ANALOG)
#define DAC0_OUT0_PA5 \
	GD32_PINMUX_AF('A', 5, ANALOG)

/* EVENTOUT */
#define EVENTOUT_PA0 \
	GD32_PINMUX_AF('A', 0, AF8)
#define EVENTOUT_PA1 \
	GD32_PINMUX_AF('A', 1, AF8)
#define EVENTOUT_PA2 \
	GD32_PINMUX_AF('A', 2, AF8)
#define EVENTOUT_PA3 \
	GD32_PINMUX_AF('A', 3, AF8)
#define EVENTOUT_PA4 \
	GD32_PINMUX_AF('A', 4, AF8)
#define EVENTOUT_PA5 \
	GD32_PINMUX_AF('A', 5, AF8)
#define EVENTOUT_PA6 \
	GD32_PINMUX_AF('A', 6, AF8)
#define EVENTOUT_PA7 \
	GD32_PINMUX_AF('A', 7, AF8)
#define EVENTOUT_PA8 \
	GD32_PINMUX_AF('A', 8, AF8)
#define EVENTOUT_PA9 \
	GD32_PINMUX_AF('A', 9, AF8)
#define EVENTOUT_PA10 \
	GD32_PINMUX_AF('A', 10, AF8)
#define EVENTOUT_PA11 \
	GD32_PINMUX_AF('A', 11, AF8)
#define EVENTOUT_PA12 \
	GD32_PINMUX_AF('A', 12, AF8)
#define EVENTOUT_PA13 \
	GD32_PINMUX_AF('A', 13, AF8)
#define EVENTOUT_PA14 \
	GD32_PINMUX_AF('A', 14, AF8)
#define EVENTOUT_PA15 \
	GD32_PINMUX_AF('A', 15, AF8)
#define EVENTOUT_PB0 \
	GD32_PINMUX_AF('B', 0, AF8)
#define EVENTOUT_PB1 \
	GD32_PINMUX_AF('B', 1, AF8)
#define EVENTOUT_PB2 \
	GD32_PINMUX_AF('B', 2, AF8)
#define EVENTOUT_PB3 \
	GD32_PINMUX_AF('B', 3, AF8)
#define EVENTOUT_PB4 \
	GD32_PINMUX_AF('B', 4, AF8)
#define EVENTOUT_PB5 \
	GD32_PINMUX_AF('B', 5, AF8)
#define EVENTOUT_PB6 \
	GD32_PINMUX_AF('B', 6, AF8)
#define EVENTOUT_PB7 \
	GD32_PINMUX_AF('B', 7, AF8)
#define EVENTOUT_PB8 \
	GD32_PINMUX_AF('B', 8, AF8)
#define EVENTOUT_PB9 \
	GD32_PINMUX_AF('B', 9, AF8)
#define EVENTOUT_PB10 \
	GD32_PINMUX_AF('B', 10, AF8)
#define EVENTOUT_PB11 \
	GD32_PINMUX_AF('B', 11, AF8)
#define EVENTOUT_PB12 \
	GD32_PINMUX_AF('B', 12, AF8)
#define EVENTOUT_PB13 \
	GD32_PINMUX_AF('B', 13, AF8)
#define EVENTOUT_PB14 \
	GD32_PINMUX_AF('B', 14, AF8)
#define EVENTOUT_PB15 \
	GD32_PINMUX_AF('B', 15, AF8)
#define EVENTOUT_PC0 \
	GD32_PINMUX_AF('C', 0, AF8)
#define EVENTOUT_PC1 \
	GD32_PINMUX_AF('C', 1, AF8)
#define EVENTOUT_PC2 \
	GD32_PINMUX_AF('C', 2, AF8)
#define EVENTOUT_PC3 \
	GD32_PINMUX_AF('C', 3, AF8)
#define EVENTOUT_PC4 \
	GD32_PINMUX_AF('C', 4, AF8)
#define EVENTOUT_PC5 \
	GD32_PINMUX_AF('C', 5, AF8)
#define EVENTOUT_PC6 \
	GD32_PINMUX_AF('C', 6, AF8)
#define EVENTOUT_PC7 \
	GD32_PINMUX_AF('C', 7, AF8)
#define EVENTOUT_PC8 \
	GD32_PINMUX_AF('C', 8, AF8)
#define EVENTOUT_PC9 \
	GD32_PINMUX_AF('C', 9, AF8)
#define EVENTOUT_PC10 \
	GD32_PINMUX_AF('C', 10, AF8)
#define EVENTOUT_PC11 \
	GD32_PINMUX_AF('C', 11, AF8)
#define EVENTOUT_PC12 \
	GD32_PINMUX_AF('C', 12, AF8)
#define EVENTOUT_PC13 \
	GD32_PINMUX_AF('C', 13, AF8)
#define EVENTOUT_PC14 \
	GD32_PINMUX_AF('C', 14, AF8)
#define EVENTOUT_PC15 \
	GD32_PINMUX_AF('C', 15, AF8)
#define EVENTOUT_PD0 \
	GD32_PINMUX_AF('D', 0, AF8)
#define EVENTOUT_PD1 \
	GD32_PINMUX_AF('D', 1, AF8)
#define EVENTOUT_PD2 \
	GD32_PINMUX_AF('D', 2, AF8)
#define EVENTOUT_PD3 \
	GD32_PINMUX_AF('D', 3, AF8)
#define EVENTOUT_PD4 \
	GD32_PINMUX_AF('D', 4, AF8)
#define EVENTOUT_PD5 \
	GD32_PINMUX_AF('D', 5, AF8)
#define EVENTOUT_PD6 \
	GD32_PINMUX_AF('D', 6, AF8)
#define EVENTOUT_PD7 \
	GD32_PINMUX_AF('D', 7, AF8)
#define EVENTOUT_PD8 \
	GD32_PINMUX_AF('D', 8, AF8)
#define EVENTOUT_PD9 \
	GD32_PINMUX_AF('D', 9, AF8)
#define EVENTOUT_PD10 \
	GD32_PINMUX_AF('D', 10, AF8)
#define EVENTOUT_PD11 \
	GD32_PINMUX_AF('D', 11, AF8)
#define EVENTOUT_PD12 \
	GD32_PINMUX_AF('D', 12, AF8)
#define EVENTOUT_PD13 \
	GD32_PINMUX_AF('D', 13, AF8)
#define EVENTOUT_PD14 \
	GD32_PINMUX_AF('D', 14, AF8)
#define EVENTOUT_PD15 \
	GD32_PINMUX_AF('D', 15, AF8)
#define EVENTOUT_PE0 \
	GD32_PINMUX_AF('E', 0, AF8)
#define EVENTOUT_PE1 \
	GD32_PINMUX_AF('E', 1, AF8)
#define EVENTOUT_PE2 \
	GD32_PINMUX_AF('E', 2, AF8)
#define EVENTOUT_PE3 \
	GD32_PINMUX_AF('E', 3, AF8)
#define EVENTOUT_PE4 \
	GD32_PINMUX_AF('E', 4, AF8)
#define EVENTOUT_PE5 \
	GD32_PINMUX_AF('E', 5, AF8)
#define EVENTOUT_PE6 \
	GD32_PINMUX_AF('E', 6, AF8)
#define EVENTOUT_PE7 \
	GD32_PINMUX_AF('E', 7, AF8)
#define EVENTOUT_PE8 \
	GD32_PINMUX_AF('E', 8, AF8)
#define EVENTOUT_PE9 \
	GD32_PINMUX_AF('E', 9, AF8)
#define EVENTOUT_PE10 \
	GD32_PINMUX_AF('E', 10, AF8)
#define EVENTOUT_PE11 \
	GD32_PINMUX_AF('E', 11, AF8)
#define EVENTOUT_PE12 \
	GD32_PINMUX_AF('E', 12, AF8)
#define EVENTOUT_PE13 \
	GD32_PINMUX_AF('E', 13, AF8)
#define EVENTOUT_PE14 \
	GD32_PINMUX_AF('E', 14, AF8)
#define EVENTOUT_PE15 \
	GD32_PINMUX_AF('E', 15, AF8)

/* EXMC_A0 */
#define EXMC_A0_PC3 \
	GD32_PINMUX_AF('C', 3, AF7)

/* EXMC_A16 */
#define EXMC_A16_PD11 \
	GD32_PINMUX_AF('D', 11, AF1)

/* EXMC_A17 */
#define EXMC_A17_PD12 \
	GD32_PINMUX_AF('D', 12, AF2)

/* EXMC_A18 */
#define EXMC_A18_PD13 \
	GD32_PINMUX_AF('D', 13, AF1)

/* EXMC_A19 */
#define EXMC_A19_PE3 \
	GD32_PINMUX_AF('E', 3, AF1)

/* EXMC_A20 */
#define EXMC_A20_PE4 \
	GD32_PINMUX_AF('E', 4, AF1)

/* EXMC_A21 */
#define EXMC_A21_PE5 \
	GD32_PINMUX_AF('E', 5, AF1)

/* EXMC_A22 */
#define EXMC_A22_PE6 \
	GD32_PINMUX_AF('E', 6, AF1)

/* EXMC_A23 */
#define EXMC_A23_PE2 \
	GD32_PINMUX_AF('E', 2, AF1)

/* EXMC_CLK */
#define EXMC_CLK_PD3 \
	GD32_PINMUX_AF('D', 3, AF1)

/* EXMC_D0 */
#define EXMC_D0_PB14 \
	GD32_PINMUX_AF('B', 14, AF7)
#define EXMC_D0_PD14 \
	GD32_PINMUX_AF('D', 14, AF1)

/* EXMC_D1 */
#define EXMC_D1_PC6 \
	GD32_PINMUX_AF('C', 6, AF7)
#define EXMC_D1_PD15 \
	GD32_PINMUX_AF('D', 15, AF1)

/* EXMC_D10 */
#define EXMC_D10_PE13 \
	GD32_PINMUX_AF('E', 13, AF1)

/* EXMC_D11 */
#define EXMC_D11_PE14 \
	GD32_PINMUX_AF('E', 14, AF1)

/* EXMC_D12 */
#define EXMC_D12_PE15 \
	GD32_PINMUX_AF('E', 15, AF1)

/* EXMC_D13 */
#define EXMC_D13_PB12 \
	GD32_PINMUX_AF('B', 12, AF7)
#define EXMC_D13_PD8 \
	GD32_PINMUX_AF('D', 8, AF1)

