GD32-MCU-IOT/hal_gigadevice_zephyr/include/dt-bindings/pinctrl/gd32f503v(g-e-c)xx-pinctrl.h
/* EXMC_D14 */
#define EXMC_D14_PD9 \
	GD32_PINMUX_AF('D', 9, AF1)

/* EXMC_D15 */
#define EXMC_D15_PD10 \
	GD32_PINMUX_AF('D', 10, AF1)

/* EXMC_D2 */
#define EXMC_D2_PC11 \
	GD32_PINMUX_AF('C', 11, AF7)
#define EXMC_D2_PD0 \
	GD32_PINMUX_AF('D', 0, AF1)

/* EXMC_D3 */
#define EXMC_D3_PC12 \
	GD32_PINMUX_AF('C', 12, AF7)
#define EXMC_D3_PD1 \
	GD32_PINMUX_AF('D', 1, AF1)

/* EXMC_D4 */
#define EXMC_D4_PA2 \
	GD32_PINMUX_AF('A', 2, AF7)
#define EXMC_D4_PE7 \
	GD32_PINMUX_AF('E', 7, AF1)

/* EXMC_D5 */
#define EXMC_D5_PA3 \
	GD32_PINMUX_AF('A', 3, AF7)
#define EXMC_D5_PE8 \
	GD32_PINMUX_AF('E', 8, AF1)

/* EXMC_D6 */
#define EXMC_D6_PA4 \
	GD32_PINMUX_AF('A', 4, AF7)
#define EXMC_D6_PE9 \
	GD32_PINMUX_AF('E', 9, AF1)

/* EXMC_D7 */
#define EXMC_D7_PA5 \
	GD32_PINMUX_AF('A', 5, AF7)
#define EXMC_D7_PE10 \
	GD32_PINMUX_AF('E', 10, AF1)

/* EXMC_D8 */
#define EXMC_D8_PE11 \
	GD32_PINMUX_AF('E', 11, AF1)

/* EXMC_D9 */
#define EXMC_D9_PE12 \
	GD32_PINMUX_AF('E', 12, AF1)

/* EXMC_NADV */
#define EXMC_NADV_PB7 \
	GD32_PINMUX_AF('B', 7, AF3)
#define EXMC_NADV_PC0 \
	GD32_PINMUX_AF('C', 0, AF7)
#define EXMC_NADV_PC9 \
	GD32_PINMUX_AF('C', 9, AF7)

/* EXMC_NBL0 */
#define EXMC_NBL0_PE0 \
	GD32_PINMUX_AF('E', 0, AF1)

/* EXMC_NBL1 */
#define EXMC_NBL1_PE1 \
	GD32_PINMUX_AF('E', 1, AF0)

/* EXMC_NCE1 */
#define EXMC_NCE1_PD7 \
	GD32_PINMUX_AF('D', 7, AF1)

/* EXMC_NE0 */
#define EXMC_NE0_PC4 \
	GD32_PINMUX_AF('C', 4, AF7)
#define EXMC_NE0_PD7 \
	GD32_PINMUX_AF('D', 7, AF1)

/* EXMC_NL */
#define EXMC_NL_PB7 \
	GD32_PINMUX_AF('B', 7, AF3)
#define EXMC_NL_PC0 \
	GD32_PINMUX_AF('C', 0, AF7)
#define EXMC_NL_PC9 \
	GD32_PINMUX_AF('C', 9, AF7)

/* EXMC_NOE */
#define EXMC_NOE_PC5 \
	GD32_PINMUX_AF('C', 5, AF7)
#define EXMC_NOE_PD4 \
	GD32_PINMUX_AF('D', 4, AF1)

/* EXMC_NWAIT */
#define EXMC_NWAIT_PD6 \
	GD32_PINMUX_AF('D', 6, AF1)

/* EXMC_NWE */
#define EXMC_NWE_PC2 \
	GD32_PINMUX_AF('C', 2, AF7)
#define EXMC_NWE_PD2 \
	GD32_PINMUX_AF('D', 2, AF7)
#define EXMC_NWE_PD5 \
	GD32_PINMUX_AF('D', 5, AF1)

/* I2C0_SCL */
#define I2C0_SCL_PB6 \
	GD32_PINMUX_AF('B', 6, AF1)
#define I2C0_SCL_PB8 \
	GD32_PINMUX_AF('B', 8, AF0)

/* I2C0_SDA */
#define I2C0_SDA_PB7 \
	GD32_PINMUX_AF('B', 7, AF1)
#define I2C0_SDA_PB9 \
	GD32_PINMUX_AF('B', 9, AF0)

/* I2C0_SMBA */
#define I2C0_SMBA_PB5 \
	GD32_PINMUX_AF('B', 5, AF2)

/* I2C1_SCL */
#define I2C1_SCL_PB10 \
	GD32_PINMUX_AF('B', 10, AF2)

/* I2C1_SDA */
#define I2C1_SDA_PB11 \
	GD32_PINMUX_AF('B', 11, AF2)

/* I2C1_SMBA */
#define I2C1_SMBA_PB12 \
	GD32_PINMUX_AF('B', 12, AF2)

/* I2S1_CK */
#define I2S1_CK_PB13 \
	GD32_PINMUX_AF('B', 13, AF1)

/* I2S1_MCK */
#define I2S1_MCK_PC6 \
	GD32_PINMUX_AF('C', 6, AF1)

/* I2S1_SD */
#define I2S1_SD_PB15 \
	GD32_PINMUX_AF('B', 15, AF0)

/* I2S1_WS */
#define I2S1_WS_PB12 \
	GD32_PINMUX_AF('B', 12, AF1)

/* I2S2_CK */
#define I2S2_CK_PB3 \
	GD32_PINMUX_AF('B', 3, AF3)
#define I2S2_CK_PC10 \
	GD32_PINMUX_AF('C', 10, AF2)

/* I2S2_MCK */
#define I2S2_MCK_PC7 \
	GD32_PINMUX_AF('C', 7, AF1)

/* I2S2_SD */
#define I2S2_SD_PB5 \
	GD32_PINMUX_AF('B', 5, AF5)
#define I2S2_SD_PC12 \
	GD32_PINMUX_AF('C', 12, AF2)

/* I2S2_WS */
#define I2S2_WS_PA4 \
	GD32_PINMUX_AF('A', 4, AF2)
#define I2S2_WS_PA15 \
	GD32_PINMUX_AF('A', 15, AF3)

/* SPI0_IO2 */
#define SPI0_IO2_PA2 \
	GD32_PINMUX_AF('A', 2, AF5)
#define SPI0_IO2_PB6 \
	GD32_PINMUX_AF('B', 6, AF5)

/* SPI0_IO3 */
#define SPI0_IO3_PA3 \
	GD32_PINMUX_AF('A', 3, AF5)
#define SPI0_IO3_PB7 \
	GD32_PINMUX_AF('B', 7, AF5)

/* SPI0_MISO */
#define SPI0_MISO_PA6 \
	GD32_PINMUX_AF('A', 6, AF0)
#define SPI0_MISO_PB4 \
	GD32_PINMUX_AF('B', 4, AF2)

/* SPI0_MOSI */
#define SPI0_MOSI_PA7 \
	GD32_PINMUX_AF('A', 7, AF0)
#define SPI0_MOSI_PB5 \
	GD32_PINMUX_AF('B', 5, AF1)

/* SPI0_NSS */
#define SPI0_NSS_PA4 \
	GD32_PINMUX_AF('A', 4, AF0)
#define SPI0_NSS_PA15 \
	GD32_PINMUX_AF('A', 15, AF2)

/* SPI0_SCK */
#define SPI0_SCK_PA5 \
	GD32_PINMUX_AF('A', 5, AF0)
#define SPI0_SCK_PB3 \
	GD32_PINMUX_AF('B', 3, AF2)

/* SPI1_MISO */
#define SPI1_MISO_PB14 \
	GD32_PINMUX_AF('B', 14, AF1)

/* SPI1_MOSI */
#define SPI1_MOSI_PB15 \
	GD32_PINMUX_AF('B', 15, AF0)

/* SPI1_NSS */
#define SPI1_NSS_PB12 \
	GD32_PINMUX_AF('B', 12, AF1)

/* SPI1_SCK */
#define SPI1_SCK_PB13 \
	GD32_PINMUX_AF('B', 13, AF1)

/* SPI2_MISO */
#define SPI2_MISO_PB4 \
	GD32_PINMUX_AF('B', 4, AF3)
#define SPI2_MISO_PC11 \
	GD32_PINMUX_AF('C', 11, AF2)

/* SPI2_MOSI */
#define SPI2_MOSI_PB5 \
	GD32_PINMUX_AF('B', 5, AF5)
#define SPI2_MOSI_PC12 \
	GD32_PINMUX_AF('C', 12, AF2)

/* SPI2_NSS */
#define SPI2_NSS_PA4 \
	GD32_PINMUX_AF('A', 4, AF2)
#define SPI2_NSS_PA15 \
	GD32_PINMUX_AF('A', 15, AF3)

/* SPI2_SCK */
#define SPI2_SCK_PB3 \
	GD32_PINMUX_AF('B', 3, AF3)
#define SPI2_SCK_PC10 \
	GD32_PINMUX_AF('C', 10, AF2)

/* TIMER0_BRKIN */
#define TIMER0_BRKIN_PA6 \
	GD32_PINMUX_AF('A', 6, AF2)
#define TIMER0_BRKIN_PB12 \
	GD32_PINMUX_AF('B', 12, AF4)
#define TIMER0_BRKIN_PE15 \
	GD32_PINMUX_AF('E', 15, AF0)

/* TIMER0_CH0 */
#define TIMER0_CH0_PA8 \
	GD32_PINMUX_AF('A', 8, AF1)
#define TIMER0_CH0_PE9 \
	GD32_PINMUX_AF('E', 9, AF0)

/* TIMER0_CH0BRKIN */
#define TIMER0_CH0BRKIN_PB5 \
	GD32_PINMUX_AF('B', 5, AF6)
#define TIMER0_CH0BRKIN_PB10 \
	GD32_PINMUX_AF('B', 10, AF4)
#define TIMER0_CH0BRKIN_PC10 \
	GD32_PINMUX_AF('C', 10, AF4)
#define TIMER0_CH0BRKIN_PD8 \
	GD32_PINMUX_AF('D', 8, AF4)

/* TIMER0_CH0_ON */
#define TIMER0_CH0_ON_PA7 \
	GD32_PINMUX_AF('A', 7, AF2)
#define TIMER0_CH0_ON_PB13 \
	GD32_PINMUX_AF('B', 13, AF2)
#define TIMER0_CH0_ON_PE8 \
	GD32_PINMUX_AF('E', 8, AF0)

/* TIMER0_CH1 */
#define TIMER0_CH1_PA9 \
	GD32_PINMUX_AF('A', 9, AF1)
#define TIMER0_CH1_PE11 \
	GD32_PINMUX_AF('E', 11, AF0)

/* TIMER0_CH1BRKIN */
#define TIMER0_CH1BRKIN_PB6 \
	GD32_PINMUX_AF('B', 6, AF6)
#define TIMER0_CH1BRKIN_PB11 \
	GD32_PINMUX_AF('B', 11, AF4)
#define TIMER0_CH1BRKIN_PD9 \
	GD32_PINMUX_AF('D', 9, AF4)

/* TIMER0_CH1_ON */
#define TIMER0_CH1_ON_PB0 \
	GD32_PINMUX_AF('B', 0, AF0)
#define TIMER0_CH1_ON_PB14 \
	GD32_PINMUX_AF('B', 14, AF2)
#define TIMER0_CH1_ON_PE10 \
	GD32_PINMUX_AF('E', 10, AF0)

/* TIMER0_CH2 */
#define TIMER0_CH2_PA10 \
	GD32_PINMUX_AF('A', 10, AF1)
#define TIMER0_CH2_PE13 \
	GD32_PINMUX_AF('E', 13, AF0)

