GD32-MCU-IOT/hal_gigadevice_zephyr/include/dt-bindings/pinctrl/gd32f503v(g-e-c)xx-pinctrl.h
/* TIMER0_CH2BRKIN */
#define TIMER0_CH2BRKIN_PB7 \
	GD32_PINMUX_AF('B', 7, AF7)
#define TIMER0_CH2BRKIN_PD10 \
	GD32_PINMUX_AF('D', 10, AF4)
#define TIMER0_CH2BRKIN_PE14 \
	GD32_PINMUX_AF('E', 14, AF4)

/* TIMER0_CH2_ON */
#define TIMER0_CH2_ON_PB1 \
	GD32_PINMUX_AF('B', 1, AF0)
#define TIMER0_CH2_ON_PB15 \
	GD32_PINMUX_AF('B', 15, AF1)
#define TIMER0_CH2_ON_PE12 \
	GD32_PINMUX_AF('E', 12, AF0)

/* TIMER0_CH3 */
#define TIMER0_CH3_PA11 \
	GD32_PINMUX_AF('A', 11, AF2)
#define TIMER0_CH3_PE14 \
	GD32_PINMUX_AF('E', 14, AF0)

/* TIMER0_CH3_ON */
#define TIMER0_CH3_ON_PA3 \
	GD32_PINMUX_AF('A', 3, AF4)
#define TIMER0_CH3_ON_PA10 \
	GD32_PINMUX_AF('A', 10, AF2)

/* TIMER0_ETI */
#define TIMER0_ETI_PA12 \
	GD32_PINMUX_AF('A', 12, AF2)
#define TIMER0_ETI_PE7 \
	GD32_PINMUX_AF('E', 7, AF0)

/* TIMER15_BRKIN */
#define TIMER15_BRKIN_PA4 \
	GD32_PINMUX_AF('A', 4, AF3)
#define TIMER15_BRKIN_PA10 \
	GD32_PINMUX_AF('A', 10, AF3)
#define TIMER15_BRKIN_PA15 \
	GD32_PINMUX_AF('A', 15, AF4)
#define TIMER15_BRKIN_PE3 \
	GD32_PINMUX_AF('E', 3, AF3)

/* TIMER15_CH0 */
#define TIMER15_CH0_PA6 \
	GD32_PINMUX_AF('A', 6, AF3)
#define TIMER15_CH0_PA11 \
	GD32_PINMUX_AF('A', 11, AF4)
#define TIMER15_CH0_PB8 \
	GD32_PINMUX_AF('B', 8, AF4)
#define TIMER15_CH0_PB14 \
	GD32_PINMUX_AF('B', 14, AF4)
#define TIMER15_CH0_PE5 \
	GD32_PINMUX_AF('E', 5, AF3)

/* TIMER15_CH1 */
#define TIMER15_CH1_PA7 \
	GD32_PINMUX_AF('A', 7, AF3)
#define TIMER15_CH1_PA10 \
	GD32_PINMUX_AF('A', 10, AF4)
#define TIMER15_CH1_PB15 \
	GD32_PINMUX_AF('B', 15, AF4)
#define TIMER15_CH1_PE6 \
	GD32_PINMUX_AF('E', 6, AF3)

/* TIMER15_MCH0 */
#define TIMER15_MCH0_PA5 \
	GD32_PINMUX_AF('A', 5, AF3)
#define TIMER15_MCH0_PA12 \
	GD32_PINMUX_AF('A', 12, AF4)
#define TIMER15_MCH0_PE4 \
	GD32_PINMUX_AF('E', 4, AF3)

/* TIMER16_BRKIN */
#define TIMER16_BRKIN_PA0 \
	GD32_PINMUX_AF('A', 0, AF2)
#define TIMER16_BRKIN_PA15 \
	GD32_PINMUX_AF('A', 15, AF5)

/* TIMER16_CH0 */
#define TIMER16_CH0_PA2 \
	GD32_PINMUX_AF('A', 2, AF2)
#define TIMER16_CH0_PB9 \
	GD32_PINMUX_AF('B', 9, AF4)
#define TIMER16_CH0_PB12 \
	GD32_PINMUX_AF('B', 12, AF6)
#define TIMER16_CH0_PC12 \
	GD32_PINMUX_AF('C', 12, AF4)

/* TIMER16_CH1 */
#define TIMER16_CH1_PA3 \
	GD32_PINMUX_AF('A', 3, AF2)
#define TIMER16_CH1_PB13 \
	GD32_PINMUX_AF('B', 13, AF6)
#define TIMER16_CH1_PC11 \
	GD32_PINMUX_AF('C', 11, AF4)

/* TIMER16_MCH0 */
#define TIMER16_MCH0_PA1 \
	GD32_PINMUX_AF('A', 1, AF2)
#define TIMER16_MCH0_PD2 \
	GD32_PINMUX_AF('D', 2, AF4)

/* TIMER1_CH0_ETI */
#define TIMER1_CH0_ETI_PA0 \
	GD32_PINMUX_AF('A', 0, AF1)
#define TIMER1_CH0_ETI_PA15 \
	GD32_PINMUX_AF('A', 15, AF1)

/* TIMER1_CH1 */
#define TIMER1_CH1_PA1 \
	GD32_PINMUX_AF('A', 1, AF1)
#define TIMER1_CH1_PB3 \
	GD32_PINMUX_AF('B', 3, AF1)

/* TIMER1_CH2 */
#define TIMER1_CH2_PA2 \
	GD32_PINMUX_AF('A', 2, AF1)
#define TIMER1_CH2_PB10 \
	GD32_PINMUX_AF('B', 10, AF0)

/* TIMER1_CH3 */
#define TIMER1_CH3_PA3 \
	GD32_PINMUX_AF('A', 3, AF1)
#define TIMER1_CH3_PB11 \
	GD32_PINMUX_AF('B', 11, AF0)

/* TIMER2_CH0 */
#define TIMER2_CH0_PA6 \
	GD32_PINMUX_AF('A', 6, AF1)
#define TIMER2_CH0_PB4 \
	GD32_PINMUX_AF('B', 4, AF1)
#define TIMER2_CH0_PC6 \
	GD32_PINMUX_AF('C', 6, AF0)

/* TIMER2_CH1 */
#define TIMER2_CH1_PA7 \
	GD32_PINMUX_AF('A', 7, AF1)
#define TIMER2_CH1_PB5 \
	GD32_PINMUX_AF('B', 5, AF0)
#define TIMER2_CH1_PC7 \
	GD32_PINMUX_AF('C', 7, AF0)

/* TIMER2_CH2 */
#define TIMER2_CH2_PB0 \
	GD32_PINMUX_AF('B', 0, AF1)
#define TIMER2_CH2_PC8 \
	GD32_PINMUX_AF('C', 8, AF0)

/* TIMER2_CH3 */
#define TIMER2_CH3_PB1 \
	GD32_PINMUX_AF('B', 1, AF1)
#define TIMER2_CH3_PC9 \
	GD32_PINMUX_AF('C', 9, AF0)

/* TIMER2_ETI */
#define TIMER2_ETI_PD2 \
	GD32_PINMUX_AF('D', 2, AF0)

/* TIMER3_CH0 */
#define TIMER3_CH0_PB6 \
	GD32_PINMUX_AF('B', 6, AF2)
#define TIMER3_CH0_PD12 \
	GD32_PINMUX_AF('D', 12, AF1)

/* TIMER3_CH1 */
#define TIMER3_CH1_PB7 \
	GD32_PINMUX_AF('B', 7, AF2)
#define TIMER3_CH1_PD13 \
	GD32_PINMUX_AF('D', 13, AF0)

/* TIMER3_CH2 */
#define TIMER3_CH2_PB8 \
	GD32_PINMUX_AF('B', 8, AF2)
#define TIMER3_CH2_PD14 \
	GD32_PINMUX_AF('D', 14, AF0)

/* TIMER3_CH3 */
#define TIMER3_CH3_PB9 \
	GD32_PINMUX_AF('B', 9, AF2)
#define TIMER3_CH3_PD15 \
	GD32_PINMUX_AF('D', 15, AF0)

/* TIMER3_ETI */
#define TIMER3_ETI_PE0 \
	GD32_PINMUX_AF('E', 0, AF0)

/* TIMER4_CH0 */
#define TIMER4_CH0_PA0 \
	GD32_PINMUX_AF('A', 0, AF3)

/* TIMER4_CH1 */
#define TIMER4_CH1_PA1 \
	GD32_PINMUX_AF('A', 1, AF3)

/* TIMER4_CH2 */
#define TIMER4_CH2_PA2 \
	GD32_PINMUX_AF('A', 2, AF3)

/* TIMER4_CH3 */
#define TIMER4_CH3_PA3 \
	GD32_PINMUX_AF('A', 3, AF3)

/* TIMER4_ETI */
#define TIMER4_ETI_PA5 \
	GD32_PINMUX_AF('A', 5, AF2)

/* TIMER7_BRKIN */
#define TIMER7_BRKIN_PA6 \
	GD32_PINMUX_AF('A', 6, AF4)

/* TIMER7_CH0 */
#define TIMER7_CH0_PA11 \
	GD32_PINMUX_AF('A', 11, AF3)
#define TIMER7_CH0_PC6 \
	GD32_PINMUX_AF('C', 6, AF3)

/* TIMER7_CH0BRKIN */
#define TIMER7_CH0BRKIN_PA5 \
	GD32_PINMUX_AF('A', 5, AF4)
#define TIMER7_CH0BRKIN_PA8 \
	GD32_PINMUX_AF('A', 8, AF4)
#define TIMER7_CH0BRKIN_PB5 \
	GD32_PINMUX_AF('B', 5, AF4)
#define TIMER7_CH0BRKIN_PC10 \
	GD32_PINMUX_AF('C', 10, AF3)

/* TIMER7_CH0_ON */
#define TIMER7_CH0_ON_PA7 \
	GD32_PINMUX_AF('A', 7, AF4)
#define TIMER7_CH0_ON_PC0 \
	GD32_PINMUX_AF('C', 0, AF0)

/* TIMER7_CH1 */
#define TIMER7_CH1_PA12 \
	GD32_PINMUX_AF('A', 12, AF3)
#define TIMER7_CH1_PC7 \
	GD32_PINMUX_AF('C', 7, AF3)

/* TIMER7_CH1BRKIN */
#define TIMER7_CH1BRKIN_PA4 \
	GD32_PINMUX_AF('A', 4, AF4)
#define TIMER7_CH1BRKIN_PA9 \
	GD32_PINMUX_AF('A', 9, AF4)
#define TIMER7_CH1BRKIN_PB6 \
	GD32_PINMUX_AF('B', 6, AF4)

/* TIMER7_CH1_ON */
#define TIMER7_CH1_ON_PB0 \
	GD32_PINMUX_AF('B', 0, AF3)
#define TIMER7_CH1_ON_PC1 \
	GD32_PINMUX_AF('C', 1, AF0)

/* TIMER7_CH2 */
#define TIMER7_CH2_PB4 \
	GD32_PINMUX_AF('B', 4, AF4)
#define TIMER7_CH2_PC8 \
	GD32_PINMUX_AF('C', 8, AF2)

/* TIMER7_CH2BRKIN */
#define TIMER7_CH2BRKIN_PA10 \
	GD32_PINMUX_AF('A', 10, AF5)
#define TIMER7_CH2BRKIN_PB7 \
	GD32_PINMUX_AF('B', 7, AF4)
#define TIMER7_CH2BRKIN_PC11 \
	GD32_PINMUX_AF('C', 11, AF3)

/* TIMER7_CH2_ON */
#define TIMER7_CH2_ON_PB1 \
	GD32_PINMUX_AF('B', 1, AF3)
#define TIMER7_CH2_ON_PC2 \
	GD32_PINMUX_AF('C', 2, AF0)

/* TIMER7_CH3 */
#define TIMER7_CH3_PC4 \
	GD32_PINMUX_AF('C', 4, AF0)
#define TIMER7_CH3_PC9 \
	GD32_PINMUX_AF('C', 9, AF2)

/* TIMER7_CH3_ON */
#define TIMER7_CH3_ON_PC3 \
	GD32_PINMUX_AF('C', 3, AF0)
#define TIMER7_CH3_ON_PC7 \
	GD32_PINMUX_AF('C', 7, AF2)

