GD32-MCU-IOT/hal_gigadevice_zephyr/include/dt-bindings/pinctrl/gd32f503v(g-e-c)xx-pinctrl.h
/* TIMER7_ETI */
#define TIMER7_ETI_PA0 \
	GD32_PINMUX_AF('A', 0, AF4)

/* TRACECK */
#define TRACECK_PE2 \
	GD32_PINMUX_AF('E', 2, AF0)

/* TRACED0 */
#define TRACED0_PE3 \
	GD32_PINMUX_AF('E', 3, AF0)

/* TRACED1 */
#define TRACED1_PE4 \
	GD32_PINMUX_AF('E', 4, AF0)

/* TRACED2 */
#define TRACED2_PE5 \
	GD32_PINMUX_AF('E', 5, AF0)

/* TRACED3 */
#define TRACED3_PE6 \
	GD32_PINMUX_AF('E', 6, AF0)

/* TRACESWO */
#define TRACESWO_PB3 \
	GD32_PINMUX_AF('B', 3, AF0)

/* TRGSEL_IN0 */
#define TRGSEL_IN0_PA11 \
	GD32_PINMUX_AF('A', 11, AF6)

/* TRGSEL_IN1 */
#define TRGSEL_IN1_PB11 \
	GD32_PINMUX_AF('B', 11, AF6)

/* TRGSEL_IN2 */
#define TRGSEL_IN2_PC11 \
	GD32_PINMUX_AF('C', 11, AF6)

/* TRGSEL_IN3 */
#define TRGSEL_IN3_PD11 \
	GD32_PINMUX_AF('D', 11, AF6)

/* TRGSEL_IN4 */
#define TRGSEL_IN4_PE11 \
	GD32_PINMUX_AF('E', 11, AF6)

/* TRGSEL_IN5 */
#define TRGSEL_IN5_PA0 \
	GD32_PINMUX_AF('A', 0, AF6)

/* TRGSEL_IN6 */
#define TRGSEL_IN6_PA1 \
	GD32_PINMUX_AF('A', 1, AF6)

/* TRGSEL_IN7 */
#define TRGSEL_IN7_PE0 \
	GD32_PINMUX_AF('E', 0, AF6)

/* TRGSEL_OUT0 */
#define TRGSEL_OUT0_PA2 \
	GD32_PINMUX_AF('A', 2, AF6)

/* TRGSEL_OUT1 */
#define TRGSEL_OUT1_PA3 \
	GD32_PINMUX_AF('A', 3, AF6)

/* TRGSEL_OUT2 */
#define TRGSEL_OUT2_PA6 \
	GD32_PINMUX_AF('A', 6, AF6)

/* TRGSEL_OUT3 */
#define TRGSEL_OUT3_PA7 \
	GD32_PINMUX_AF('A', 7, AF6)

/* TRGSEL_OUT4 */
#define TRGSEL_OUT4_PA8 \
	GD32_PINMUX_AF('A', 8, AF6)

/* TRGSEL_OUT5 */
#define TRGSEL_OUT5_PA9 \
	GD32_PINMUX_AF('A', 9, AF6)

/* TRGSEL_OUT6 */
#define TRGSEL_OUT6_PB4 \
	GD32_PINMUX_AF('B', 4, AF6)

/* TRGSEL_OUT7 */
#define TRGSEL_OUT7_PB7 \
	GD32_PINMUX_AF('B', 7, AF6)

/* UART3_RX */
#define UART3_RX_PC11 \
	GD32_PINMUX_AF('C', 11, AF1)

/* UART3_TX */
#define UART3_TX_PC10 \
	GD32_PINMUX_AF('C', 10, AF1)

/* UART4_RX */
#define UART4_RX_PD2 \
	GD32_PINMUX_AF('D', 2, AF1)

/* UART4_TX */
#define UART4_TX_PC12 \
	GD32_PINMUX_AF('C', 12, AF1)

/* USART0_CK */
#define USART0_CK_PA8 \
	GD32_PINMUX_AF('A', 8, AF0)

/* USART0_CTS */
#define USART0_CTS_PA11 \
	GD32_PINMUX_AF('A', 11, AF0)

/* USART0_RTS */
#define USART0_RTS_PA12 \
	GD32_PINMUX_AF('A', 12, AF0)

/* USART0_RX */
#define USART0_RX_PA10 \
	GD32_PINMUX_AF('A', 10, AF0)
#define USART0_RX_PB7 \
	GD32_PINMUX_AF('B', 7, AF0)

/* USART0_TX */
#define USART0_TX_PA9 \
	GD32_PINMUX_AF('A', 9, AF0)
#define USART0_TX_PB6 \
	GD32_PINMUX_AF('B', 6, AF0)

/* USART1_CK */
#define USART1_CK_PA4 \
	GD32_PINMUX_AF('A', 4, AF1)
#define USART1_CK_PD7 \
	GD32_PINMUX_AF('D', 7, AF0)

/* USART1_CTS */
#define USART1_CTS_PA0 \
	GD32_PINMUX_AF('A', 0, AF0)
#define USART1_CTS_PD3 \
	GD32_PINMUX_AF('D', 3, AF0)

/* USART1_RTS */
#define USART1_RTS_PA1 \
	GD32_PINMUX_AF('A', 1, AF0)
#define USART1_RTS_PD4 \
	GD32_PINMUX_AF('D', 4, AF0)

/* USART1_RX */
#define USART1_RX_PA3 \
	GD32_PINMUX_AF('A', 3, AF0)
#define USART1_RX_PD6 \
	GD32_PINMUX_AF('D', 6, AF0)

/* USART1_TX */
#define USART1_TX_PA2 \
	GD32_PINMUX_AF('A', 2, AF0)
#define USART1_TX_PD5 \
	GD32_PINMUX_AF('D', 5, AF0)

/* USART2_CK */
#define USART2_CK_PB12 \
	GD32_PINMUX_AF('B', 12, AF0)
#define USART2_CK_PC12 \
	GD32_PINMUX_AF('C', 12, AF0)
#define USART2_CK_PD10 \
	GD32_PINMUX_AF('D', 10, AF0)

/* USART2_CTS */
#define USART2_CTS_PB13 \
	GD32_PINMUX_AF('B', 13, AF0)
#define USART2_CTS_PD11 \
	GD32_PINMUX_AF('D', 11, AF0)

/* USART2_RTS */
#define USART2_RTS_PB14 \
	GD32_PINMUX_AF('B', 14, AF0)
#define USART2_RTS_PD12 \
	GD32_PINMUX_AF('D', 12, AF0)

/* USART2_RX */
#define USART2_RX_PB11 \
	GD32_PINMUX_AF('B', 11, AF1)
#define USART2_RX_PC11 \
	GD32_PINMUX_AF('C', 11, AF0)
#define USART2_RX_PD9 \
	GD32_PINMUX_AF('D', 9, AF0)

/* USART2_TX */
#define USART2_TX_PB10 \
	GD32_PINMUX_AF('B', 10, AF1)
#define USART2_TX_PC10 \
	GD32_PINMUX_AF('C', 10, AF0)
#define USART2_TX_PD8 \
	GD32_PINMUX_AF('D', 8, AF0)

/* USBFS_SOF */
#define USBFS_SOF_PA8 \
	GD32_PINMUX_AF('A', 8, AF2)
